avrdudes/avr-libc/include/avr/ioavr64du32.h
/* USB.FIFO  bit masks and bit positions */
#define USB_DIR_bm  0x08  /* Endpoint Direction bit mask. */
#define USB_DIR_bp  3  /* Endpoint Direction bit position. */
#define USB_EPNUM_gm  0xF0  /* Endpoint Number group mask. */
#define USB_EPNUM_gp  4  /* Endpoint Number group position. */
#define USB_EPNUM_0_bm  (1<<4)  /* Endpoint Number bit 0 mask. */
#define USB_EPNUM_0_bp  4  /* Endpoint Number bit 0 position. */
#define USB_EPNUM_1_bm  (1<<5)  /* Endpoint Number bit 1 mask. */
#define USB_EPNUM_1_bp  5  /* Endpoint Number bit 1 position. */
#define USB_EPNUM_2_bm  (1<<6)  /* Endpoint Number bit 2 mask. */
#define USB_EPNUM_2_bp  6  /* Endpoint Number bit 2 position. */
#define USB_EPNUM_3_bm  (1<<7)  /* Endpoint Number bit 3 mask. */
#define USB_EPNUM_3_bp  7  /* Endpoint Number bit 3 position. */

/* USB.FRAMENUM  bit masks and bit positions */
#define USB_FRAMENUM_gm  0x7FF  /* Frame Number group mask. */
#define USB_FRAMENUM_gp  0  /* Frame Number group position. */
#define USB_FRAMENUM_0_bm  (1<<0)  /* Frame Number bit 0 mask. */
#define USB_FRAMENUM_0_bp  0  /* Frame Number bit 0 position. */
#define USB_FRAMENUM_1_bm  (1<<1)  /* Frame Number bit 1 mask. */
#define USB_FRAMENUM_1_bp  1  /* Frame Number bit 1 position. */
#define USB_FRAMENUM_2_bm  (1<<2)  /* Frame Number bit 2 mask. */
#define USB_FRAMENUM_2_bp  2  /* Frame Number bit 2 position. */
#define USB_FRAMENUM_3_bm  (1<<3)  /* Frame Number bit 3 mask. */
#define USB_FRAMENUM_3_bp  3  /* Frame Number bit 3 position. */
#define USB_FRAMENUM_4_bm  (1<<4)  /* Frame Number bit 4 mask. */
#define USB_FRAMENUM_4_bp  4  /* Frame Number bit 4 position. */
#define USB_FRAMENUM_5_bm  (1<<5)  /* Frame Number bit 5 mask. */
#define USB_FRAMENUM_5_bp  5  /* Frame Number bit 5 position. */
#define USB_FRAMENUM_6_bm  (1<<6)  /* Frame Number bit 6 mask. */
#define USB_FRAMENUM_6_bp  6  /* Frame Number bit 6 position. */
#define USB_FRAMENUM_7_bm  (1<<7)  /* Frame Number bit 7 mask. */
#define USB_FRAMENUM_7_bp  7  /* Frame Number bit 7 position. */
#define USB_FRAMENUM_8_bm  (1<<8)  /* Frame Number bit 8 mask. */
#define USB_FRAMENUM_8_bp  8  /* Frame Number bit 8 position. */
#define USB_FRAMENUM_9_bm  (1<<9)  /* Frame Number bit 9 mask. */
#define USB_FRAMENUM_9_bp  9  /* Frame Number bit 9 position. */
#define USB_FRAMENUM_10_bm  (1<<10)  /* Frame Number bit 10 mask. */
#define USB_FRAMENUM_10_bp  10  /* Frame Number bit 10 position. */
#define USB_FRAMEERR_bm  0x8000  /* Frame Error bit mask. */
#define USB_FRAMEERR_bp  15  /* Frame Error bit position. */


/* USB.OUTCLR  bit masks and bit positions */
#define USB_RMWSTATUS_gm  0xFF  /* Read-Modify-Write Endpoint STATUS group mask. */
#define USB_RMWSTATUS_gp  0  /* Read-Modify-Write Endpoint STATUS group position. */
#define USB_RMWSTATUS_0_bm  (1<<0)  /* Read-Modify-Write Endpoint STATUS bit 0 mask. */
#define USB_RMWSTATUS_0_bp  0  /* Read-Modify-Write Endpoint STATUS bit 0 position. */
#define USB_RMWSTATUS_1_bm  (1<<1)  /* Read-Modify-Write Endpoint STATUS bit 1 mask. */
#define USB_RMWSTATUS_1_bp  1  /* Read-Modify-Write Endpoint STATUS bit 1 position. */
#define USB_RMWSTATUS_2_bm  (1<<2)  /* Read-Modify-Write Endpoint STATUS bit 2 mask. */
#define USB_RMWSTATUS_2_bp  2  /* Read-Modify-Write Endpoint STATUS bit 2 position. */
#define USB_RMWSTATUS_3_bm  (1<<3)  /* Read-Modify-Write Endpoint STATUS bit 3 mask. */
#define USB_RMWSTATUS_3_bp  3  /* Read-Modify-Write Endpoint STATUS bit 3 position. */
#define USB_RMWSTATUS_4_bm  (1<<4)  /* Read-Modify-Write Endpoint STATUS bit 4 mask. */
#define USB_RMWSTATUS_4_bp  4  /* Read-Modify-Write Endpoint STATUS bit 4 position. */
#define USB_RMWSTATUS_5_bm  (1<<5)  /* Read-Modify-Write Endpoint STATUS bit 5 mask. */
#define USB_RMWSTATUS_5_bp  5  /* Read-Modify-Write Endpoint STATUS bit 5 position. */
#define USB_RMWSTATUS_6_bm  (1<<6)  /* Read-Modify-Write Endpoint STATUS bit 6 mask. */
#define USB_RMWSTATUS_6_bp  6  /* Read-Modify-Write Endpoint STATUS bit 6 position. */
#define USB_RMWSTATUS_7_bm  (1<<7)  /* Read-Modify-Write Endpoint STATUS bit 7 mask. */
#define USB_RMWSTATUS_7_bp  7  /* Read-Modify-Write Endpoint STATUS bit 7 position. */

/* USB.OUTSET  bit masks and bit positions */
/* USB_RMWSTATUS  is already defined. */

/* USB.INCLR  bit masks and bit positions */
/* USB_RMWSTATUS  is already defined. */

/* USB.INSET  bit masks and bit positions */
/* USB_RMWSTATUS  is already defined. */



/* VPORT - Virtual Ports */
/* VPORT.INTFLAGS  bit masks and bit positions */
#define VPORT_INT_gm  0xFF  /* Pin Interrupt Flag group mask. */
#define VPORT_INT_gp  0  /* Pin Interrupt Flag group position. */
#define VPORT_INT_0_bm  (1<<0)  /* Pin Interrupt Flag bit 0 mask. */
#define VPORT_INT_0_bp  0  /* Pin Interrupt Flag bit 0 position. */
#define VPORT_INT_1_bm  (1<<1)  /* Pin Interrupt Flag bit 1 mask. */
#define VPORT_INT_1_bp  1  /* Pin Interrupt Flag bit 1 position. */
#define VPORT_INT_2_bm  (1<<2)  /* Pin Interrupt Flag bit 2 mask. */
#define VPORT_INT_2_bp  2  /* Pin Interrupt Flag bit 2 position. */
#define VPORT_INT_3_bm  (1<<3)  /* Pin Interrupt Flag bit 3 mask. */
#define VPORT_INT_3_bp  3  /* Pin Interrupt Flag bit 3 position. */
#define VPORT_INT_4_bm  (1<<4)  /* Pin Interrupt Flag bit 4 mask. */
#define VPORT_INT_4_bp  4  /* Pin Interrupt Flag bit 4 position. */
#define VPORT_INT_5_bm  (1<<5)  /* Pin Interrupt Flag bit 5 mask. */
#define VPORT_INT_5_bp  5  /* Pin Interrupt Flag bit 5 position. */
#define VPORT_INT_6_bm  (1<<6)  /* Pin Interrupt Flag bit 6 mask. */
#define VPORT_INT_6_bp  6  /* Pin Interrupt Flag bit 6 position. */
#define VPORT_INT_7_bm  (1<<7)  /* Pin Interrupt Flag bit 7 mask. */
#define VPORT_INT_7_bp  7  /* Pin Interrupt Flag bit 7 position. */


/* VREF - Voltage reference */
/* VREF.ACREF  bit masks and bit positions */
#define VREF_REFSEL_gm  0x07  /* Reference select group mask. */
#define VREF_REFSEL_gp  0  /* Reference select group position. */
#define VREF_REFSEL_0_bm  (1<<0)  /* Reference select bit 0 mask. */
#define VREF_REFSEL_0_bp  0  /* Reference select bit 0 position. */
#define VREF_REFSEL_1_bm  (1<<1)  /* Reference select bit 1 mask. */
#define VREF_REFSEL_1_bp  1  /* Reference select bit 1 position. */
#define VREF_REFSEL_2_bm  (1<<2)  /* Reference select bit 2 mask. */
#define VREF_REFSEL_2_bp  2  /* Reference select bit 2 position. */
#define VREF_ALWAYSON_bm  0x80  /* Always on bit mask. */
#define VREF_ALWAYSON_bp  7  /* Always on bit position. */


